// Первое задание

let tc = 30;
let tf = (9 / 5) * tc + 32;
alert(tf);

// Второе задание

let admin;
let name;
name = 'Василий';
admin = name;
alert(admin); 

// Третье задание

'1000108' // Выражение выдаст строку, потому что если один операнд является строкой, то и второй преобразуется в строку.

// Четвертое задание

// Атрибут defer сообщает браузеру, что он должен продолжать обрабатывать страницу и загружать скрипт в фоновом режиме, а затем запустить этот скрипт, когда DOM дерево будет полностью построено.

// Атрибут async означает, что скрипт абсолютно независим и может загрузиться в любое время.

